RIET/src/InformationRegisters/СегментыКостЦентров/СегментыКостЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СегментыКостЦентров</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>(Общ) Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>(Общ) Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>(Общ) Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС12</name>
    <comment>(Общ) Ставка НДС 12%</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>(Общ)</comment>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>LawsonID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEnglish</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентLawson</name>
    <type>
      <types>CatalogRef.КонтрагентыLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаИспользования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/CommonModules/ПолучениеСсылок/Module.bsl
Функция ПолучитьСтавкуНДСИзTaxCode(TaxCode, Период) Экспорт
	
	Суффикс = Прав(TaxCode, 3);
	Если Суффикс = "STD" Тогда		
		Возврат РГСофт.ПолучитьСсылкуСтавкаНДСОтПериода(Период); // RGS EParshina 29.12.2018 18:39:43 - SLI-0007797 //Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли Суффикс = "WHT" Тогда   //изменил Трефиленков Дмитрий, РГ-Софт, 16.11.2011 по вопросу SLI-0002060 
		Возврат РГСофт.ПолучитьСсылкуСтавкаНДСОтПериода(Период, Истина); // RGS EParshina 29.12.2018 18:39:43 - SLI-0007797 //Перечисления.СтавкиНДС.НДС18_118;
	ИначеЕсли Суффикс = "DIS" Тогда  //изменил Трефиленков Дмитрий, РГ-Софт, 26.12.2012 по вопросу SLI-0003016
		Возврат Перечисления.СтавкиНДС.БезНДС;
	ИначеЕсли Суффикс = "ZER" Тогда
		Возврат Перечисления.СтавкиНДС.БезНДС;
	ИначеЕсли Суффикс = "10%" Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли TaxCode = "RUMOSVTCST"
		ИЛИ TaxCode = "RUSAKVTCST" Тогда
		Возврат Перечисления.СтавкиНДС.НДС18
	Иначе
		Возврат Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////
// ОРГАНИЗАЦИЯ

Функция ПолучитьОрганизациюПоCompany(Company) Экспорт
	
	//Изменила Федотова Л., РГ-Софт, 19.05.15, вопрос PA_-0000346
	//Если Company = 4 Тогда
	//	
	//	Возврат УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
	//	
	//КонецЕсли;
	Если ОбщегоНазначенияПовтИсп.ИдентификаторРабочейКонфигурации() = "PA" Тогда
		Если Company = 364 Тогда
			
			Возврат УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
			
		КонецЕсли;
	Иначе
		Если Company = 4 Тогда
			
			Возврат УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Организации.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьCompanyПоОрганизации(Организация) Экспорт
	
	Если Организация =  УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация") Тогда
	
		Возврат 4;		
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////
// AU

Функция ПолучитьТаблицуAU() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//-> RG-Soft VIvanov 2015/02/18
		//"ВЫБРАТЬ
		//|	КостЦентры.Ссылка,
		//|	КостЦентры.Код
		//|ИЗ
		//|	Справочник.КостЦентры КАК КостЦентры
		//|ГДЕ
		//|	(НЕ КостЦентры.ПометкаУдаления)";
	"ВЫБРАТЬ
	|	КостЦентры.Ссылка,
	|	КостЦентры.Код,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СегментыКостЦентров.КостЦентр) КАК КостЦентр
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.КостЦентры КАК КостЦентры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СегментыКостЦентров КАК СегментыКостЦентров
	|		ПО СегментыКостЦентров.Код = КостЦентры.Код
	|ГДЕ
	|	НЕ КостЦентры.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	КостЦентры.Ссылка,
	|	КостЦентры.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка,
	|	ВТ.Код
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.КостЦентр <= 1";
	//<- RG-Soft VIvanov
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ПрименитьСокрЛПККолонкеКод(Таблица);
	
	Таблица.Индексы.Добавить("Код");
	
	Возврат Таблица;
	
КонецФункции

Функция НайтиAUВТаблице(Таблица, Код) Экспорт
	
	Строка = Таблица.Найти(Код, "Код");
	Если Строка = Неопределено Тогда
		Возврат Справочники.КостЦентры.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Строка.Ссылка;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////
// КОНТРАГЕНТЫ

// КОНТРАГЕНТЫ LAWSON!!!
Функция ПолучитьКонтрагентаПоLawsonIDИНаименованиюEnglish(LawsonID, НаименованиеEnglish, Таблица = Неопределено) Экспорт
	
	Если Таблица <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("LawsonID", LawsonID);
		Строки = Таблица.НайтиСтроки(СтруктураПоиска);
	Иначе
		
		Запрос = Новый Запрос;
	    Запрос.УстановитьПараметр("LawsonID", LawsonID);
		// И НЕ НАДО ИСПРАВЛЯТЬ ЗАПРОС ПОКА НЕ ЗАРАБОТАЕТ СПРАВОЧНИК КОНТРАГЕНТЫ LAWSON!!!
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка,
			|	Контрагенты.НаименованиеEnglish
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	(НЕ Контрагенты.ПометкаУдаления)
			|	И Контрагенты.LawsonID = &LawsonID";
			
		Строки = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	КоличествоСтрок = Строки.Количество();
	
	Если НЕ КоличествоСтрок Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	// Если найден один контрагент - его и возвращаем
	Если КоличествоСтрок = 1 Тогда
		Возврат Строки[0].Ссылка;
	КонецЕсли;
		
	// Ищем контрагента с совпадающим английским наименованием
	Для Каждого Строка Из Строки Цикл
			
		Если Строка.НаименованиеEnglish = НаименованиеEnglish Тогда
			Возврат Строка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если дошли до этой строки - значит такого контрагента нет, выводим ошибку
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьКонтрагентаПоLawsonID_КонтрагентLawson_НаименованиюEnglish(LawsonID, НаименованиеEnglish, Таблица = Неопределено) Экспорт
	
	Если Таблица <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("LawsonID", LawsonID);
		Строки = Таблица.НайтиСтроки(СтруктураПоиска);
	Иначе
		
		Запрос = Новый Запрос;
	    Запрос.УстановитьПараметр("LawsonID", LawsonID);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка,
			|	Контрагенты.НаименованиеEnglish,
			|	Контрагенты.КонтрагентLawson,
			|	Контрагенты.LawsonID
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	(НЕ Контрагенты.ПометкаУдаления)
			|	И Контрагенты.LawsonID = &LawsonID";
			
		Результат = Запрос.Выполнить();	
		Строки = Результат.Выгрузить();
		
	КонецЕсли;
	
	КоличествоСтрок = Строки.Количество();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	// Если найден один контрагент - его и возвращаем
	Если КоличествоСтрок = 1 Тогда
		Если Строки[0].Ссылка.КонтрагентLawson.Пустая()
			И НЕ Строки[0].КонтрагентLawson.Пустая() Тогда
			КонтрагентОбъект = Строки[0].Ссылка.ПолучитьОбъект();
			КонтрагентОбъект.КонтрагентLawson = Строки[0].КонтрагентLawson;
			Попытка
				КонтрагентОбъект.Записать();
			Исключение
			    Сообщить(ОписаниеОшибки());
			КонецПопытки; 
		КонецЕсли; 
		Возврат Строки[0].Ссылка;
	КонецЕсли;
	
		
	// Ищем контрагента с совпадающим кодом КонтрагентLawson
	Для Каждого Строка Из Строки Цикл
			
		Если Строка.LawsonID = Строка.КонтрагентLawson.Код Тогда
			Возврат Строка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	// Ищем контрагента с совпадающим английским наименованием
	Для Каждого Строка Из Строки Цикл
			
		Если Строка.НаименованиеEnglish = НаименованиеEnglish Тогда
			Возврат Строка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если дошли до этой строки - значит такого контрагента нет, выводим ошибку
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

// КОНТРАГЕНТЫ LAWSON!!!
Функция ПолучитьТаблицуКонтрагентов() Экспорт
	
	Запрос = Новый Запрос;
	
	// И НЕ НАДО ИСПРАВЛЯТЬ ЗАПРОС ПОКА НЕ ЗАРАБОТАЕТ СПРАВОЧНИК КОНТРАГЕНТЫ LAWSON!!!
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.LawsonID КАК LawsonID,
		|	Контрагенты.НаименованиеEnglish
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(НЕ Контрагенты.ПометкаУдаления)";
		
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Индексы.Добавить("LawsonID");
	
	Возврат Таблица;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////
// КЕШ-КОДЫ

Функция ПолучитьCashCodeПоКодуСоздатьНовый(Код, ТаблицаКешКодов = Неопределено) Экспорт
	
	CashCode = ПолучитьCashCodeПоКоду(Код, ТаблицаКешКодов);
	
	Если НЕ ЗначениеЗаполнено(CashCode) И ЗначениеЗаполнено(Код) Тогда
		
		CashCodeОбъект = Справочники.CashCode.СоздатьЭлемент();
		CashCodeОбъект.Код = Код;
		
		Попытка
			CashCodeОбъект.Записать();
			CashCode = CashCodeОбъект.Ссылка;
		Исключение
			Возврат Справочники.CashCode.ПустаяСсылка();
		КонецПопытки;
			
	КонецЕсли;
	
	// ВОЗВРАЩАТЬ ТЮМЕНСКИЙ КЕШ КОД!!!
	
	Возврат CashCode;
	
КонецФункции

Функция ПолучитьCashCodeПоКоду(Код, ТаблицаКешКодов = Неопределено) Экспорт
	
	Если ТаблицаКешКодов <> Неопределено Тогда
		CashCode = ПолучениеСсылок.НайтиКешКодВТаблице(ТаблицаКешКодов, Код);
	Иначе
		CashCode = Справочники.CashCode.НайтиПоКоду(Код);
	КонецЕсли;
	
	Возврат CashCode;
	
КонецФункции

Функция ПолучитьТаблицуКешКодов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CashCode.Ссылка,
		|	CashCode.Код
		|ИЗ
		|	Справочник.CashCode КАК CashCode
		|ГДЕ
		|	(НЕ CashCode.ПометкаУдаления)";
		
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ПрименитьСокрЛПККолонкеКод(Таблица);
	
	Таблица.Индексы.Добавить("Код");
	
	Возврат Таблица;
	
КонецФункции

Функция НайтиКешКодВТаблице(Таблица, Код) Экспорт
	
	Строка = Таблица.Найти(Код, "Код");
	Если Строка = Неопределено Тогда
		Возврат Справочники.CashCode.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Строка.Ссылка;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////
// ПОДРАЗДЕЛЕНИЯ

Функция ПолучитьТаблицуПодразделений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка,
		|	ПодразделенияОрганизаций.Код
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	(НЕ ПодразделенияОрганизаций.ПометкаУдаления)";
		
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ПрименитьСокрЛПККолонкеКод(Таблица);
	
	Таблица.Индексы.Добавить("Код");
	
	Возврат Таблица;
	
КонецФункции

Функция НайтиПодразделениеВТаблице(Таблица, Код) Экспорт
	
	Строка = Таблица.Найти(Код, "Код");
	Если Строка = Неопределено Тогда
		Возврат Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Строка.Ссылка;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ЗАТРАТ

Функция ПолучитьОписаниеЗатрат(AktOfAcceptance) Экспорт
	
	Если СтрНайти(AktOfAcceptance, "FND") Тогда
		Возврат Справочники.ОписаниеЗатрат.НайтиПоКоду(538); // FA
	ИначеЕсли СтрНайти(AktOfAcceptance, "NR") Тогда
		Возврат Справочники.ОписаниеЗатрат.НайтиПоКоду(548); // ND
	КонецЕсли;
	
	Возврат Справочники.ОписаниеЗатрат.ПустаяСсылка();
	
КонецФункции
	
	
//////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ, ФУНКЦИИ

Процедура ПрименитьСокрЛПККолонкеКод(Таблица)
	
	Колонки = Таблица.Колонки;
	
	СтараяКолонка = Колонки.Код;
	Длина = СтараяКолонка.ТипЗначения.КвалификаторыСтроки.Длина;
	СтараяКолонка.Имя = "КодСтарый";
	
	Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(Длина, ДопустимаяДлина.Переменная)));
	
	Для Каждого Строка Из Таблица Цикл
		Строка.Код = СокрЛП(Строка.КодСтарый);
	КонецЦикла;
	
	Колонки.Удалить(СтараяКолонка);
	
КонецПроцедуры
